/******************************************************************
*版权所有 (C)2021, 江苏华如防务科技有限公司
*
*文件名称:  protocal.h
*文件标识:
*内容摘要:
*其它说明:
*当前版本:
*作    者: 
*完成日期:  2021/4/23
*
*修改记录1:
*    修改日期:
*    版 本 号:
*    修 改 人:
*    修改内容:
******************************************************************/
#ifndef  _PROTOCAL_H
#define  _PROTOCAL_H
/******************************************************************
*                             头文件                              *
******************************************************************/
#include "config.h"


/****************************************************************
@FUNCTION：计算CRC8
@INPUT：a_byBase-生成多项式 a_pBuf-数据指针 a_BufLen-数据长度
@OUTPUT：无
@RETURN: CRC8结果
@AUTHOR：xfw
@SPECIAL:生成多项式
CRC-8       x8+x5+x4+1              0x31（0x131）
CRC-8       x8+x2+x1+1              0x07（0x107）
CRC-8       x8+x6+x4+x3+x2+x1       0x5E（0x15E）

****************************************************************/
uint8_t Crc8_Calc(uint8_t a_byBase,uint8_t *a_pBuf,uint8_t a_byBufLen);


/*
************************************************************************************************************************************************************************     
*函数名称: Crc16_Calc
*功能描述: 计算Modbus的CRC校验
*输入描述: 待计算校验报文、计算长度
*输出描述: 无
*返回描述: 双字节校验值
*作者日期: 
*全局声明: 无
*特殊说明: 适用于下行Modbus校验，Modbus协议传输时，返回值低位先发，高位后发
************************************************************************************************************************************************************************       
*/
extern uint16_t Crc16_Calc(const uint8_t *pBuf, uint32_t Len);

/****************************************************************
@FUNCTION：计算异或和
@INPUT：a_pBuf-数据指针 a_BufLen-数据长度
@OUTPUT：无
@RETURN: 结果
@AUTHOR：xfw
@SPECIAL:
****************************************************************/
extern uint8_t Xor_Calc(uint8_t *a_pBuf, uint16_t a_BufLen);

//计算crc校验函数
unsigned int Rx_CRC_CCITT(unsigned char *puchMsg, unsigned int usDataLen);

uint8_t GetProtAddr(void);

uint8_t Protocol_FindC1XORFrame(const uint8_t *pBuf, uint16_t *pLen, uint32_t *pIsCutted, uint16_t MtuSize);
/*
************************************************************************************************************************************************************************     
*函数名称: Protocal_Find55AAFrame
*功能描述: 解析55AA协议报文
*输入描述: 
	@@@ pBuf-报文
	@@@ pLen - 报文长度
	@@@ MtuSize - 缓冲临界值，55AA协议长包数据段最长达0xFFFF-9
*输出描述: 
	@@@ pIsCutted - 是否不完整
	@@@ pIsLong55AA - 是否是长包
*返回描述: TRUE - 传入报文满足协议 ， FALSE - 传入报文不满足协议
*作者日期: XFW 
*全局声明: 无
*特殊说明: 
************************************************************************************************************************************************************************       
*/
extern uint32_t Protocal_Find55AAFrame(const uint8_t *pBuf, uint16_t *pLen, uint32_t *pIsCutted, uint32_t *pIsLong55AA, uint16_t MtuSize);

/*
************************************************************************************************************************************************************************     
*函数名称: Protocal_ProtocolMakeLong55AA
*功能描述: 55AA长报文组包
*输入描述: 
	@@@ pbyData - 数据载荷
	@@@ wDataLen - 数据长度
*输出描述: 
	@@@ pbyBuf - 报文
	@@@ pwDataLen - 报文长度
*返回描述: TRUE - 成功 ， FALSE - 失败
*作者日期: XFW 
*全局声明: 无
*特殊说明: 
************************************************************************************************************************************************************************       
*/
extern uint32_t Protocal_ProtocolMakeLong55AA(const uint8_t *pbyData, uint16_t wDataLen,
					uint8_t *pbyBuf, uint16_t *pwDataLen);
					

/*
************************************************************************************************************************************************************************     
*函数名称: Protocal_ProtocolMakeShort55AA
*功能描述: 55AA短报文组包
*输入描述: 
	@@@ pbyData - 数据载荷
	@@@ wDataLen - 数据长度
*输出描述: 
	@@@ pbyBuf - 报文
	@@@ pwDataLen - 报文长度
*返回描述: TRUE - 成功 ， FALSE - 失败
*作者日期: XFW 
*全局声明: 无
*特殊说明: 
************************************************************************************************************************************************************************       
*/
extern uint32_t Protocal_ProtocolMakeShort55AA(const uint8_t *pbyData, uint16_t wDataLen,
					uint8_t *pbySendBuf, uint16_t *pwSendLen);					

/*
************************************************************************************************************************************************************************     
*函数名称: Protocal_MakeU8Sum
*功能描述: 计算校验和，U8
*输入描述: 待计算校验报文、计算长度
*输出描述: 无
*返回描述: 单字节校验和
*作者日期: XFW 
*全局声明: 无
*特殊说明: 
************************************************************************************************************************************************************************       
*/
extern uint8_t Protocal_MakeU8Sum(const uint8_t *byBuf,const uint32_t dwCnt);


extern uint32_t Protocal_GetU16Sum(const uint16_t *wBuf,const uint32_t dwCnt);


extern uint32_t Protocal_MakeU32Sum(const uint8_t *byBuf,const uint32_t dwCnt);

/*
************************************************************************************************************************************************************************     
*函数名称: Protocal_Find5AAAFrame
*功能描述: 解析报文是否满足5AAA协议
*输入描述: 
	@@@ pBuf - 数据载荷
	@@@ pLen - 数据长度
*输出描述: 
	@@@ pIsCutted - 符合协议，但包不完整
*返回描述: TRUE - 成功 ， FALSE - 失败
*作者日期: XFW 
*全局声明: 无
*特殊说明: 
************************************************************************************************************************************************************************       
*/
uint8_t Protocal_Find5AAAFrame(uint8_t *pBuf,uint16_t *pLen,uint32_t *pIsCutted);


/*
************************************************************************************************************************************************************************     
*函数名称: Protocal_FindNMEA0183String
*功能描述: 解析报文是否满足NMEA协议
*输入描述: 
	@@@ pBuf - 数据载荷
	@@@ pLen - 数据长度
*输出描述: 
	@@@ pIsCutted - 符合协议，但包不完整
*返回描述: TRUE - 成功 ， FALSE - 失败
*作者日期: XFW 
*全局声明: 无
*特殊说明: 
************************************************************************************************************************************************************************       
*/
uint32_t Protocal_FindNMEA0183String(uint8_t *pBuf, uint16_t *pLen, uint32_t *pIsCutted);

/****************************************************************
@FUNCTION：寻找红外短距的报文
@INPUT：
    @param pBuf-数据指针 
    @param pLen-数据长度
@OUTPUT：符合协议报文长度
@RETURN: TRUE - 成功 ， FALSE - 失败
@AUTHOR：xfw
@SPECIAL:
****************************************************************/
uint8_t Protocal_FindIR38_Frame(uint8_t *pBuf, uint16_t *pLen);

/****************************************************************
@FUNCTION：寻找符合互联互通协议的报文
@INPUT：
    @param pBuf-数据指针 
    @param pLen-数据长度
@OUTPUT：符合协议报文长度
@RETURN: TRUE - 成功 ， FALSE - 失败
@AUTHOR：xfw
@SPECIAL:
****************************************************************/
uint8_t Protocal_FindInterConn_Frame(uint8_t *pBuf, uint16_t *pLen);


typedef struct
{
    uint8_t m_byStart;
    uint8_t m_byCmd;
    uint8_t m_byWidget;
    uint8_t m_aParam[51];
    uint16_t   m_wParamLen;
}HMI_268B_FRAME;

/****************************************************************
@FUNCTION：解析传入的字符串，是否满足乐升TFT串口屏通信协议
@INPUT：待解析数据pBuf及长度pLen
@OUTPUT：pLen真实帧长度、pIsCutted是否被分包
@RETURN: TRUE-成功(分包或解析成功) FALSE-失败
@AUTHOR：xfw
@SPECIAL:
****************************************************************/
uint32_t Protocal_FindHmi268bFrame(uint8_t *pBuf, uint16_t *pLen, uint32_t *pIsCutted);

/*
************************************************************************************************************************************************************************     
*函数名称: Protocal_ProtocolMakeHmi268B
*功能描述: 乐升LT268B协议组包
*输入描述: 
	@@@ pFrame - 协议帧
	@@@ pbyData - 数据载荷
	@@@ wDataLen - 数据长度
*输出描述: 
	@@@ pbyBuf - 报文
	@@@ pwDataLen - 报文长度
*返回描述: TRUE - 成功 ， FALSE - 失败
*作者日期: XFW 
*全局声明: 无
*特殊说明: 
************************************************************************************************************************************************************************       
*/
extern uint32_t Protocal_ProtocolMakeHmi268b(const HMI_268B_FRAME *pFrame, uint8_t *pbySendBuf, uint16_t *pwSendLen);



#endif


