/******************************************************************
*版权所有 (C)2023,江苏华如防务科技有限公司
*
*文件名称:  sort.h
*文件标识:
*内容摘要:
*其它说明:
*当前版本:
*作    者: 
*完成日期:  2023/4/11
*
*修改记录1:
*    修改日期:
*    版 本 号:
*    修 改 人:xfw
*    修改内容:
******************************************************************/
#ifndef  _SORT_H
#define  _SORT_H
/******************************************************************
*                             头文件                              *
******************************************************************/
#include <stdint.h>



/****************************************************************
@FUNCTION：冒泡排序，针对U16数据类型
@INPUT：
@OUTPUT：
@RETURN:
@AUTHOR：
@SPECIAL:
****************************************************************/
extern void Bubble_Sort_U16(uint16_t *a,uint16_t n);


/****************************************************************
@FUNCTION：选择法排序，针对U16数据类型
@INPUT：
@OUTPUT：
@RETURN:
@AUTHOR：
@SPECIAL:
****************************************************************/
extern void Choose_Sort_U16(uint16_t *unsorted,uint32_t len);

#endif

